Autodesk.Navisworks.Api.Plugins.DockPanePlugin
A plugin that can be used to add a docking pane to the GUI.

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.#ctor
Default constructor for a DockPanePlugin

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.ActivatePane
Activates the pane (i.e. makes it the window with keyboard focus), also making it
visible first, if necessary.

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.CreateControlPane
Called to tell the plugin to create it's pane. The pane will be resized as specified by the
DockPanePluginAttribute.
Should be overriden in conjunction with
DestroyControlPane.
Returns:
A Control that contains the pane content

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.CreateHWndPane(System.Windows.Forms.IWin32Window)
Called to tell the plugin to create it's pane. The pane will be resized as specified by the
DockPanePluginAttribute.
Should be overriden in conjunction with
DestroyHWndPane.
parent:
The pane should be created using this window as it's parent
Returns:
The handle of window that contains the pane content

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.DestroyControlPane(System.Windows.Forms.Control)
Called to tell the plugin to destroy it's pane
Should be overriden in conjunction with
CreateControlPane.
pane:
The pane to destroy

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.DestroyHWndPane(System.Windows.Forms.IWin32Window)
Called to tell the plugin to destroy it's pane.
Should be overriden in conjunction with
CreateHWndPane.
pane:
The pane to destroy

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.OnActivePaneChanged(System.Boolean)
Called when the active pane changes

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.OnVisibleChanged
Called when the visibility of the pane changes

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.TryShowHelp
Called to tell the plugin to display help
Returns:
Return true if you have handled this call

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.TryShowHelpAtScreenPoint(System.Int32,System.Int32)
Called to tell the plugin to display help at a screen point
Returns:
Return true if you have handled this call

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.TryShowHelpForHighlight
Called to tell the plugin to display help for highlight
Returns:
Return true if you have handled this call

Autodesk.Navisworks.Api.Plugins.DockPanePlugin.Visible
The visibility of the pane